# AdvancedWood Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood Class
Members See Also
---
A static class that provides access to the property names that appear in the AdvancedWood visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class AdvancedWood
```

Visual Basic
---
```text
Public NotInheritable Class AdvancedWood
```

Visual C++
---
```text
public ref class AdvancedWood abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AdvancedWood
# See Also
AdvancedWood Members
Autodesk.Revit.DB.Visual Namespace